In [1]:
import pandas as pd
import numpy as np
from statsmodels.stats.weightstats import ttest_ind,ztest

In [2]:
df=pd.read_csv(r'D:\COURSES\AI\Epsilon Ai\Session 20\AB_Datasets\classroom_actions.csv')
df

                       timestamp      id       group  total_days  completed
0     2015-08-10 17:06:01.032740  610019  experiment          97       True
1     2015-08-10 17:15:28.950975  690224     control          75      False
2     2015-08-10 17:34:40.920384  564994  experiment         128       True
3     2015-08-10 17:50:39.847374  849588  experiment          66      False
4     2015-08-10 19:10:40.650599  849826  experiment          34      False
...                          ...     ...         ...         ...        ...
3824  2016-01-19 09:26:08.197754  364453  experiment          63      False
3825  2016-01-19 13:03:23.000822  519239     control          87       True
3826  2016-01-19 13:57:27.787897  508316  experiment         103       True
3827  2016-01-19 14:54:40.124679  244124     control          73      False
3828  2016-01-19 15:21:31.634379  511677  experiment          86       True

[3829 rows x 5 columns]

In [3]:
df[df['group']=='experiment']

                       timestamp      id       group  total_days  completed
0     2015-08-10 17:06:01.032740  610019  experiment          97       True
2     2015-08-10 17:34:40.920384  564994  experiment         128       True
3     2015-08-10 17:50:39.847374  849588  experiment          66      False
4     2015-08-10 19:10:40.650599  849826  experiment          34      False
8     2015-08-10 21:03:33.719529  929620  experiment          90      False
...                          ...     ...         ...         ...        ...
3818  2016-01-19 01:13:40.858762  522568  experiment         102       True
3820  2016-01-19 03:38:20.977586  819668  experiment          78       True
3824  2016-01-19 09:26:08.197754  364453  experiment          63      False
3826  2016-01-19 13:57:27.787897  508316  experiment         103       True
3828  2016-01-19 15:21:31.634379  511677  experiment          86       True

[2165 rows x 5 columns]

In [4]:
df['total_days'].mean()

74.1055105771742

In [5]:
df[df['group']=='experiment']['total_days'].mean()

74.6715935334873

In [6]:
df[df['group']=='control'].total_days.mean()

73.36899038461539

In [7]:
# Ha: Average_experiment>average_control
#H1: x\ >M

In [8]:
ztest(df[df['group']=='experiment'].total_days,df[df['group']=='control'].total_days,alternative='larger')

(1.784221674871853, 0.037193825815102055)

In [9]:
ttest_ind(df[df['group']=='experiment'].total_days,df[df['group']=='control'].total_days,alternative='larger')

(1.7842216748718527, 0.03723342678032589, 3827.0)

## Pandas

In [10]:
arr=np.array([1,23,4,6,5,7])

In [11]:
ser=pd.Series(arr,index=['a','b','c','d','e','f'])
ser

a     1
b    23
c     4
d     6
e     5
f     7
dtype: int32

In [12]:
ser['b']

23

In [13]:
ser.mean()

7.666666666666667

In [14]:
ser.median()

5.5

In [15]:
data=np.random.randn(5,4)

In [16]:
data

array([[-0.80405658, -1.07195406,  0.43095523, -0.39764106],
       [ 0.27961175,  0.44550109,  0.42519955, -0.80284653],
       [-0.64817049,  0.65355883,  0.68251565,  1.45770022],
       [-1.76976826, -1.10804029, -0.75559075, -0.28205601],
       [ 0.82982861, -0.48325001, -0.23061728, -0.74778205]])

In [17]:
df=pd.DataFrame(data,index=['a','b','c','d','e'],columns=['col1','col2','col3','col4'])
df

       col1      col2      col3      col4
a -0.804057 -1.071954  0.430955 -0.397641
b  0.279612  0.445501  0.425200 -0.802847
c -0.648170  0.653559  0.682516  1.457700
d -1.769768 -1.108040 -0.755591 -0.282056
e  0.829829 -0.483250 -0.230617 -0.747782

In [18]:
df['col1']

a   -0.804057
b    0.279612
c   -0.648170
d   -1.769768
e    0.829829
Name: col1, dtype: float64

In [19]:
df[['col1','col2']]

       col1      col2
a -0.804057 -1.071954
b  0.279612  0.445501
c -0.648170  0.653559
d -1.769768 -1.108040
e  0.829829 -0.483250

In [20]:
df['col5']=[3,6,1,7,3]

In [21]:
df

       col1      col2      col3      col4  col5
a -0.804057 -1.071954  0.430955 -0.397641     3
b  0.279612  0.445501  0.425200 -0.802847     6
c -0.648170  0.653559  0.682516  1.457700     1
d -1.769768 -1.108040 -0.755591 -0.282056     7
e  0.829829 -0.483250 -0.230617 -0.747782     3

In [22]:
df['col5']*12

a    36
b    72
c    12
d    84
e    36
Name: col5, dtype: int64

In [23]:
df['col5']=df['col5']-df['col2']

In [24]:
df

       col1      col2      col3      col4      col5
a -0.804057 -1.071954  0.430955 -0.397641  4.071954
b  0.279612  0.445501  0.425200 -0.802847  5.554499
c -0.648170  0.653559  0.682516  1.457700  0.346441
d -1.769768 -1.108040 -0.755591 -0.282056  8.108040
e  0.829829 -0.483250 -0.230617 -0.747782  3.483250

In [25]:
def f1(x):
    return x**2/4
df['col5']=df['col5'].apply(f1)

In [26]:
df

       col1      col2      col3      col4       col5
a -0.804057 -1.071954  0.430955 -0.397641   4.145202
b  0.279612  0.445501  0.425200 -0.802847   7.713115
c -0.648170  0.653559  0.682516  1.457700   0.030005
d -1.769768 -1.108040 -0.755591 -0.282056  16.435079
e  0.829829 -0.483250 -0.230617 -0.747782   3.033258

In [27]:
df[['col1','col4']]['col1']

a   -0.804057
b    0.279612
c   -0.648170
d   -1.769768
e    0.829829
Name: col1, dtype: float64

In [28]:
df['col5']=df['col5'].apply(lambda x:x*3)

In [29]:
df

       col1      col2      col3      col4       col5
a -0.804057 -1.071954  0.430955 -0.397641  12.435607
b  0.279612  0.445501  0.425200 -0.802847  23.139344
c -0.648170  0.653559  0.682516  1.457700   0.090016
d -1.769768 -1.108040 -0.755591 -0.282056  49.305238
e  0.829829 -0.483250 -0.230617 -0.747782   9.099773

In [30]:
df['col6']=['sdfs','sdf','weerwef','wdfcqv','trgc']

In [31]:
df

       col1      col2      col3      col4       col5     col6
a -0.804057 -1.071954  0.430955 -0.397641  12.435607     sdfs
b  0.279612  0.445501  0.425200 -0.802847  23.139344      sdf
c -0.648170  0.653559  0.682516  1.457700   0.090016  weerwef
d -1.769768 -1.108040 -0.755591 -0.282056  49.305238   wdfcqv
e  0.829829 -0.483250 -0.230617 -0.747782   9.099773     trgc

In [32]:
df['col7']=df['col6'].apply(len)
df

       col1      col2      col3      col4       col5     col6  col7
a -0.804057 -1.071954  0.430955 -0.397641  12.435607     sdfs     4
b  0.279612  0.445501  0.425200 -0.802847  23.139344      sdf     3
c -0.648170  0.653559  0.682516  1.457700   0.090016  weerwef     7
d -1.769768 -1.108040 -0.755591 -0.282056  49.305238   wdfcqv     6
e  0.829829 -0.483250 -0.230617 -0.747782   9.099773     trgc     4

In [33]:
df.drop('col4',axis=1)

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
b  0.279612  0.445501  0.425200  23.139344      sdf     3
c -0.648170  0.653559  0.682516   0.090016  weerwef     7
d -1.769768 -1.108040 -0.755591  49.305238   wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773     trgc     4

In [34]:
df.drop(['col3','col4'],axis=1)

       col1      col2       col5     col6  col7
a -0.804057 -1.071954  12.435607     sdfs     4
b  0.279612  0.445501  23.139344      sdf     3
c -0.648170  0.653559   0.090016  weerwef     7
d -1.769768 -1.108040  49.305238   wdfcqv     6
e  0.829829 -0.483250   9.099773     trgc     4

In [35]:
df.drop('col4',axis=1,inplace=True)

In [36]:
df

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
b  0.279612  0.445501  0.425200  23.139344      sdf     3
c -0.648170  0.653559  0.682516   0.090016  weerwef     7
d -1.769768 -1.108040 -0.755591  49.305238   wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773     trgc     4

In [37]:
df.head()

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
b  0.279612  0.445501  0.425200  23.139344      sdf     3
c -0.648170  0.653559  0.682516   0.090016  weerwef     7
d -1.769768 -1.108040 -0.755591  49.305238   wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773     trgc     4

In [38]:
df.tail()

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
b  0.279612  0.445501  0.425200  23.139344      sdf     3
c -0.648170  0.653559  0.682516   0.090016  weerwef     7
d -1.769768 -1.108040 -0.755591  49.305238   wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773     trgc     4

In [39]:
df.shape

(5, 6)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    5 non-null      float64
 1   col2    5 non-null      float64
 2   col3    5 non-null      float64
 3   col5    5 non-null      float64
 4   col6    5 non-null      object
 5   col7    5 non-null      int64
dtypes: float64(4), int64(1), object(1)
memory usage: 452.0+ bytes

In [41]:
df.describe()

           col1      col2      col3       col5      col7
count  5.000000  5.000000  5.000000   5.000000  5.000000
mean  -0.422511 -0.312837  0.110492  18.813996  4.800000
std    1.009075  0.828650  0.590636  18.934505  1.643168
min   -1.769768 -1.108040 -0.755591   0.090016  3.000000
25%   -0.804057 -1.071954 -0.230617   9.099773  4.000000
50%   -0.648170 -0.483250  0.425200  12.435607  4.000000
75%    0.279612  0.445501  0.430955  23.139344  6.000000
max    0.829829  0.653559  0.682516  49.305238  7.000000

In [42]:
df.loc['a']

col1    -0.804057
col2    -1.071954
col3     0.430955
col5    12.435607
col6         sdfs
col7            4
Name: a, dtype: object

In [43]:
df.loc[['a','c']]

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
c -0.648170  0.653559  0.682516   0.090016  weerwef     7

In [44]:
df[['col1','col5']].loc[['a','e']]

       col1       col5
a -0.804057  12.435607
e  0.829829   9.099773

In [45]:
df.loc['c','col2']

0.6535588293317819

In [46]:
df

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
b  0.279612  0.445501  0.425200  23.139344      sdf     3
c -0.648170  0.653559  0.682516   0.090016  weerwef     7
d -1.769768 -1.108040 -0.755591  49.305238   wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773     trgc     4

In [47]:
df[df==0.30371766692485547]

   col1  col2  col3  col5 col6  col7
a   NaN   NaN   NaN   NaN  NaN   NaN
b   NaN   NaN   NaN   NaN  NaN   NaN
c   NaN   NaN   NaN   NaN  NaN   NaN
d   NaN   NaN   NaN   NaN  NaN   NaN
e   NaN   NaN   NaN   NaN  NaN   NaN

In [48]:
df['col6'].value_counts()

col6
sdfs       1
sdf        1
weerwef    1
wdfcqv     1
trgc       1
Name: count, dtype: int64

In [49]:
df['col2'].unique()

array([-1.07195406,  0.44550109,  0.65355883, -1.10804029, -0.48325001])

In [50]:
df['col2'].nunique()

5

In [51]:
df.loc['a']

col1    -0.804057
col2    -1.071954
col3     0.430955
col5    12.435607
col6         sdfs
col7            4
Name: a, dtype: object

In [52]:
df.loc[['a','c']]

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
c -0.648170  0.653559  0.682516   0.090016  weerwef     7

In [53]:
df.iloc[1]

col1     0.279612
col2     0.445501
col3       0.4252
col5    23.139344
col6          sdf
col7            3
Name: b, dtype: object

In [54]:
df.iloc[[0,2]]

       col1      col2      col3       col5     col6  col7
a -0.804057 -1.071954  0.430955  12.435607     sdfs     4
c -0.648170  0.653559  0.682516   0.090016  weerwef     7

In [55]:
df.iloc[1:4][['col2','col7']]

       col2  col7
b  0.445501     3
c  0.653559     7
d -1.108040     6

In [56]:
df.loc['w']=df.loc['e']*3

In [57]:
df

       col1      col2      col3       col5          col6  col7
a -0.804057 -1.071954  0.430955  12.435607          sdfs     4
b  0.279612  0.445501  0.425200  23.139344           sdf     3
c -0.648170  0.653559  0.682516   0.090016       weerwef     7
d -1.769768 -1.108040 -0.755591  49.305238        wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773          trgc     4
w  2.489486 -1.449750 -0.691852  27.299319  trgctrgctrgc    12

In [58]:
df.drop('c',axis=0,inplace=True)

In [59]:
df

       col1      col2      col3       col5          col6  col7
a -0.804057 -1.071954  0.430955  12.435607          sdfs     4
b  0.279612  0.445501  0.425200  23.139344           sdf     3
d -1.769768 -1.108040 -0.755591  49.305238        wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773          trgc     4
w  2.489486 -1.449750 -0.691852  27.299319  trgctrgctrgc    12

In [60]:
df.loc[df['col2']>0]

       col1      col2    col3       col5 col6  col7
b  0.279612  0.445501  0.4252  23.139344  sdf     3

In [62]:
df

       col1      col2      col3       col5          col6  col7
a -0.804057 -1.071954  0.430955  12.435607          sdfs     4
b  0.279612  0.445501  0.425200  23.139344           sdf     3
d -1.769768 -1.108040 -0.755591  49.305238        wdfcqv     6
e  0.829829 -0.483250 -0.230617   9.099773          trgc     4
w  2.489486 -1.449750 -0.691852  27.299319  trgctrgctrgc    12

In [63]:
df.iloc[1:4,1:3]

       col2      col3
b  0.445501  0.425200
d -1.108040 -0.755591
e -0.483250 -0.230617

In [64]:
df.to_csv('classroom.csv')